src/functionalTest/resources/soapRegisterFull.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header>
    <ServiceContext token="temporary/127.0.0.1-1700061962100--7690714146928305881" xmlns="http://context.core.datamodel.fs.documentum.emc.com/" xmlns:ns2="http://properties.core.datamodel.fs.documentum.emc.com/" xmlns:ns3="http://profiles.core.datamodel.fs.documentum.emc.com/" xmlns:ns4="http://query.core.datamodel.fs.documentum.emc.com/" xmlns:ns5="http://content.core.datamodel.fs.documentum.emc.com/" xmlns:ns6="http://core.datamodel.fs.documentum.emc.com/">
      <Identities password="darts" repositoryName="moj_darts" userName="viq_ws_user" xsi:type="RepositoryIdentity" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"></Identities>
      <Profiles allowAsyncContentTransfer="false" allowCachedContentTransfer="false" isProcessOLELinks="false" transferMode="MTOM" xsi:type="ns3:ContentTransferProfile" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"></Profiles>
    </ServiceContext>
  </S:Header>
  <S:Body>
    <ns8:register xmlns:ns8="http://services.rt.fs.documentum.emc.com/" xmlns:ns7="http://core.datamodel.fs.documentum.emc.com/" xmlns:ns6="http://content.core.datamodel.fs.documentum.emc.com/" xmlns:ns5="http://query.core.datamodel.fs.documentum.emc.com/" xmlns:ns4="http://profiles.core.datamodel.fs.documentum.emc.com/" xmlns:ns3="http://properties.core.datamodel.fs.documentum.emc.com/" xmlns:ns2="http://context.core.datamodel.fs.documentum.emc.com/">
      <context>
        <ns2:Identities xsi:type="ns2:RepositoryIdentity" repositoryName="moj_darts" password="darts" userName="viq_ws_user" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"></ns2:Identities>
        <ns2:Profiles xsi:type="ns4:ContentTransferProfile" isProcessOLELinks="false" allowAsyncContentTransfer="false" allowCachedContentTransfer="false" transferMode="MTOM" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"></ns2:Profiles>
      </context>
      <host>http://localhost:8070/service/darts/</host>
    </ns8:register>
  </S:Body>
</S:Envelope>
